RT-Thread/rt-thread/bsp/hc32l196/libraries/HC32L196_StdPeriph_Driver/inc/hc32l196_gpio.h
/**
 *******************************************************************************
 ** \brief GPIO 辅助功能（SF-Secondary Function）定时器互联功能选择类型定义
 ** \note  具体功能及含义请参考用户手册GPIO辅助寄存器描述
 ******************************************************************************/
typedef enum en_gpio_sf
{
    GpioSf0 = 0u,       ///< SF0:PX_SEL的配置功能
    GpioSf1 = 1u,       ///< SF1:辅助功能1
    GpioSf2 = 2u,       ///< SF2:辅助功能2
    GpioSf3 = 3u,       ///< SF3:辅助功能3
    GpioSf4 = 4u,       ///< SF4:辅助功能4
    GpioSf5 = 5u,       ///< SF5:辅助功能5
    GpioSf6 = 6u,       ///< SF6:辅助功能6
    GpioSf7 = 7u,       ///< SF7:辅助功能7
}en_gpio_sf_t;

/**
 *******************************************************************************
 ** \brief GPIO 辅助功能（SF-Secondary Function）定时器门控类型选择数据类型定义
 ******************************************************************************/
typedef enum en_gpio_sf_tim_g
{
    GpioSfTim0G   = 0u,                   ///<Tim0定时器GATE输入选择
    GpioSfTim1G   = 3u,                   ///<Tim1定时器GATE输入选择
    GpioSfTim2G   = 6u,                   ///<Tim2定时器GATE输入选择
    GpioSfTim3G   = 9u,                   ///<Tim3定时器GATE输入选择
    GpioSfLpTim0G = 12u,                  ///<LPTim0定时器GATE输入选择
    GpioSfLpTim1G = 38u,                  ///<LPTim1定时器GATE输入选择
}en_gpio_sf_tim_g_t;

/**
 *******************************************************************************
 ** \brief GPIO 辅助功能（SF-Secondary Function）定时器ETR类型选择数据类型定义
 ******************************************************************************/
typedef enum en_gpio_sf_tim_e
{
    GpioSfTim0E   = 0u,                   ///<Tim0定时器ETR输入选择
    GpioSfTim1E   = 3u,                   ///<Tim1定时器ETR输入选择
    GpioSfTim2E   = 6u,                   ///<Tim2定时器ETR输入选择
    GpioSfTim3E   = 9u,                   ///<Tim3定时器ETR输入选择
    GpioSfLpTim0E = 12u,                  ///<LPTim0定时器ETR输入选择
    GpioSfLpTim1E = 41u,                  ///<LPTim1定时器ETR输入选择
}en_gpio_sf_tim_e_t;

/**
 *******************************************************************************
 ** \brief GPIO 辅助功能（SF-Secondary Function）定时器捕获输入类型选择数据类型定义
 ******************************************************************************/
typedef enum en_gpio_sf_tim_c
{
    GpioSfTim0CA = 0u,                   ///<Tim0定时器CHA输入选择
    GpioSfTim1CA = 3u,                   ///<Tim1定时器CHA输入选择
    GpioSfTim2CA = 6u,                   ///<Tim2定时器CHA输入选择
    GpioSfTim3CA = 9u,                   ///<Tim3定时器CH0A输入选择
    GpioSfTim3CB = 12u,                  ///<Tim3定时器CH0B输入选择
}en_gpio_sf_tim_c_t;

/**
 *******************************************************************************
 ** \brief GPIO 辅助功能（SF-Secondary Function）PCA捕获选择数据类型定义
 ******************************************************************************/
typedef enum en_gpio_sf_pca
{
    GpioSfPcaCH0 = 0u,                   ///<PCA_CH0捕获口输入选择
    GpioSfPcaECI = 3u,                   ///<PCA ECI时钟输入选择
}en_gpio_sf_pca_t;

/**
 *******************************************************************************
 ** \brief GPIO 辅助功能（SF-Secondary Function）PCNT脉冲输入选择数据类型定义
 ******************************************************************************/
typedef enum en_gpio_sf_pcnt
{
    GpioSfPcntS0 = 0u,                   ///<PCNT_S0输入选择
    GpioSfPcntS1 = 3u,                   ///<PCNT_S1输入选择
}en_gpio_sf_pcnt_t;

/**
 *******************************************************************************
 ** \brief GPIO 端口配置结构体定义
 ******************************************************************************/
typedef struct
{
    boolean_t           bOutputVal;      ///< 默认端口输出电平
    en_gpio_dir_t       enDir;           ///< 端口方向配置
    en_gpio_drv_t       enDrv;           ///< 端口驱动能力配置
    en_gpio_pu_t        enPu;            ///< 端口上拉配置
    en_gpio_pd_t        enPd;            ///< 端口下拉配置
    en_gpio_od_t        enOD;            ///< 端口开漏输出配置
    en_gpio_ctrl_mode_t enCtrlMode;      ///< 端口输入/输出值寄存器总线控制模式配置
}stc_gpio_cfg_t;

/*******************************************************************************
 * Global definitions——(GPIO 复用功能宏定义)
 ******************************************************************************/
///< GPIO 复用功能宏定义
///< GpioAf1
#define PA00_UART1_CTS    (GpioPortA<<16u|GpioPin0 <<8u|GpioAf1)
#define PA01_UART1_RTS    (GpioPortA<<16u|GpioPin1 <<8u|GpioAf1)
#define PA02_UART1_TXD    (GpioPortA<<16u|GpioPin2 <<8u|GpioAf1)
#define PA03_UART1_RXD    (GpioPortA<<16u|GpioPin3 <<8u|GpioAf1)
#define PA04_SPI0_CS      (GpioPortA<<16u|GpioPin4 <<8u|GpioAf1)
#define PA05_SPI0_SCK     (GpioPortA<<16u|GpioPin5 <<8u|GpioAf1)
#define PA06_SPI0_MISO    (GpioPortA<<16u|GpioPin6 <<8u|GpioAf1)
#define PA07_SPI0_MOSI    (GpioPortA<<16u|GpioPin7 <<8u|GpioAf1)
#define PA08_UART0_TXD    (GpioPortA<<16u|GpioPin8 <<8u|GpioAf1)
#define PA09_UART0_TXD    (GpioPortA<<16u|GpioPin9 <<8u|GpioAf1)
#define PA10_UART0_RXD    (GpioPortA<<16u|GpioPin10<<8u|GpioAf1)
#define PA11_UART0_CTS    (GpioPortA<<16u|GpioPin11<<8u|GpioAf1)
#define PA12_UART0_RTS    (GpioPortA<<16u|GpioPin12<<8u|GpioAf1)
#define PA13_IR_OUT       (GpioPortA<<16u|GpioPin13<<8u|GpioAf1)
#define PA14_UART1_TXD    (GpioPortA<<16u|GpioPin14<<8u|GpioAf1)
#define PA15_SPI0_CS      (GpioPortA<<16u|GpioPin15<<8u|GpioAf1)
#define PB00_PCA_CH2      (GpioPortB<<16u|GpioPin0 <<8u|GpioAf1)
#define PB01_PCA_CH3      (GpioPortB<<16u|GpioPin1 <<8u|GpioAf1)
#define PB02_LPTIM_TOG    (GpioPortB<<16u|GpioPin2 <<8u|GpioAf1)
#define PB03_SPI0_SCK     (GpioPortB<<16u|GpioPin3 <<8u|GpioAf1)
#define PB04_SPI0_MISO    (GpioPortB<<16u|GpioPin4 <<8u|GpioAf1)
#define PB05_SPI0_MOSI    (GpioPortB<<16u|GpioPin5 <<8u|GpioAf1)
#define PB06_I2C0_SCL     (GpioPortB<<16u|GpioPin6 <<8u|GpioAf1)
#define PB07_I2C0_SDA     (GpioPortB<<16u|GpioPin7 <<8u|GpioAf1)
#define PB08_I2C0_SCL     (GpioPortB<<16u|GpioPin8 <<8u|GpioAf1)
#define PB09_I2C0_SDA     (GpioPortB<<16u|GpioPin9 <<8u|GpioAf1)
#define PB10_I2C1_SCL     (GpioPortB<<16u|GpioPin10<<8u|GpioAf1)
#define PB11_I2C1_SDA     (GpioPortB<<16u|GpioPin11<<8u|GpioAf1)
#define PB12_SPI1_CS      (GpioPortB<<16u|GpioPin12<<8u|GpioAf1)
#define PB13_SPI1_SCK     (GpioPortB<<16u|GpioPin13<<8u|GpioAf1)
#define PB14_SPI1_MISO    (GpioPortB<<16u|GpioPin14<<8u|GpioAf1)
#define PB15_SPI1_MOSI    (GpioPortB<<16u|GpioPin15<<8u|GpioAf1)
#define PC00_LPTIM_GATE   (GpioPortC<<16u|GpioPin0 <<8u|GpioAf1)
#define PC01_LPTIM_TOG    (GpioPortC<<16u|GpioPin1 <<8u|GpioAf1)
#define PC02_SPI1_MISO    (GpioPortC<<16u|GpioPin2 <<8u|GpioAf1)
#define PC03_SPI1_MOSI    (GpioPortC<<16u|GpioPin3 <<8u|GpioAf1)
#define PC04_LPUART0_TXD  (GpioPortC<<16u|GpioPin4 <<8u|GpioAf1)
#define PC05_LPUART0_RXD  (GpioPortC<<16u|GpioPin5 <<8u|GpioAf1)
#define PC06_PCA_CH0      (GpioPortC<<16u|GpioPin6 <<8u|GpioAf1)
#define PC07_PCA_CH1      (GpioPortC<<16u|GpioPin7 <<8u|GpioAf1)
#define PC08_PCA_CH2      (GpioPortC<<16u|GpioPin8 <<8u|GpioAf1)
#define PC09_PCA_CH3      (GpioPortC<<16u|GpioPin9 <<8u|GpioAf1)
#define PC10_LPUART1_TXD  (GpioPortC<<16u|GpioPin10<<8u|GpioAf1)
#define PC11_LPUART1_RXD  (GpioPortC<<16u|GpioPin11<<8u|GpioAf1)
#define PC12_LPUART0_TXD  (GpioPortC<<16u|GpioPin12<<8u|GpioAf1)
#define PC13_1x           (GpioPortC<<16u|GpioPin13<<8u|GpioAf1)
#define PC14_1x           (GpioPortC<<16u|GpioPin14<<8u|GpioAf1)
#define PC15_1x           (GpioPortC<<16u|GpioPin15<<8u|GpioAf1)
#define PD00_1x           (GpioPortD<<16u|GpioPin0 <<8u|GpioAf1)
#define PD01_1x           (GpioPortD<<16u|GpioPin1 <<8u|GpioAf1)
#define PD02_PCA_ECI      (GpioPortD<<16u|GpioPin2 <<8u|GpioAf1)
#define PD03_UART1_CTS    (GpioPortD<<16u|GpioPin3 <<8u|GpioAf1)
#define PD04_UART1_RTS    (GpioPortD<<16u|GpioPin4 <<8u|GpioAf1)
#define PD05_UART1_TXD    (GpioPortD<<16u|GpioPin5 <<8u|GpioAf1)
#define PD06_UART1_RXD    (GpioPortD<<16u|GpioPin6 <<8u|GpioAf1)
#define PD07_UART1_TXD    (GpioPortD<<16u|GpioPin7 <<8u|GpioAf1)
#define PD08_LPUART0_TXD  (GpioPortD<<16u|GpioPin8 <<8u|GpioAf1)
#define PD09_LPUART0_RXD  (GpioPortD<<16u|GpioPin9 <<8u|GpioAf1)
#define PD10_LPUART0_TXD  (GpioPortD<<16u|GpioPin10<<8u|GpioAf1)
#define PD11_LPUART0_CTS  (GpioPortD<<16u|GpioPin11<<8u|GpioAf1)
#define PD12_LPUART0_RTS  (GpioPortD<<16u|GpioPin12<<8u|GpioAf1)
#define PD13_UART2_RXD    (GpioPortD<<16u|GpioPin13<<8u|GpioAf1)
#define PD14_UART2_TXD    (GpioPortD<<16u|GpioPin14<<8u|GpioAf1)
#define PD15_1x           (GpioPortD<<16u|GpioPin15<<8u|GpioAf1)
#define PE00_TIM1_CHA     (GpioPortE<<16u|GpioPin0 <<8u|GpioAf1)
#define PE01_TIM2_CHA     (GpioPortE<<16u|GpioPin1 <<8u|GpioAf1)
#define PE02_PCA_ECI      (GpioPortE<<16u|GpioPin2 <<8u|GpioAf1)
#define PE03_PCA_CH0      (GpioPortE<<16u|GpioPin3 <<8u|GpioAf1)
#define PE04_PCA_CH1      (GpioPortE<<16u|GpioPin4 <<8u|GpioAf1)
#define PE05_PCA_CH2      (GpioPortE<<16u|GpioPin5 <<8u|GpioAf1)
#define PE06_PCA_CH3      (GpioPortE<<16u|GpioPin6 <<8u|GpioAf1)
#define PE07_TIM3_ETR     (GpioPortE<<16u|GpioPin7 <<8u|GpioAf1)
#define PE08_TIM3_CH0B    (GpioPortE<<16u|GpioPin8 <<8u|GpioAf1)
#define PE09_TIM3_CH0A    (GpioPortE<<16u|GpioPin9 <<8u|GpioAf1)
#define PE10_TIM3_CH1B    (GpioPortE<<16u|GpioPin10<<8u|GpioAf1)
#define PE11_TIM3_CH1A    (GpioPortE<<16u|GpioPin11<<8u|GpioAf1)
#define PE12_TIM3_CH2B    (GpioPortE<<16u|GpioPin12<<8u|GpioAf1)
#define PE13_TIM3_CH2A    (GpioPortE<<16u|GpioPin13<<8u|GpioAf1)
#define PE14_TIM3_CH0B    (GpioPortE<<16u|GpioPin14<<8u|GpioAf1)
#define PE15_TIM3_BK      (GpioPortE<<16u|GpioPin15<<8u|GpioAf1)
#define PF00_I2C0_SDA     (GpioPortF<<16u|GpioPin0 <<8u|GpioAf1)
#define PF01_I2C0_SCL     (GpioPortF<<16u|GpioPin1 <<8u|GpioAf1)
#define PF02_1x           (GpioPortF<<16u|GpioPin2 <<8u|GpioAf1)
#define PF03_1x           (GpioPortF<<16u|GpioPin3 <<8u|GpioAf1)
#define PF04_1x           (GpioPortF<<16u|GpioPin4 <<8u|GpioAf1)
#define PF05_1x           (GpioPortF<<16u|GpioPin5 <<8u|GpioAf1)
#define PF06_I2C1_SCL     (GpioPortF<<16u|GpioPin6 <<8u|GpioAf1)
#define PF07_I2C1_SDA     (GpioPortF<<16u|GpioPin7 <<8u|GpioAf1)
#define PF09_TIM0_CHA     (GpioPortF<<16u|GpioPin9 <<8u|GpioAf1)
#define PF10_TIM0_CHB     (GpioPortF<<16u|GpioPin10<<8u|GpioAf1)
#define PF11_1x           (GpioPortF<<16u|GpioPin11<<8u|GpioAf1)


 ///< GpioAf2
#define PA00_LPUART1_TXD  (GpioPortA<<16u|GpioPin0 <<8u|GpioAf2)
#define PA01_LPUART1_RXD  (GpioPortA<<16u|GpioPin1 <<8u|GpioAf2)
#define PA02_TIM0_CHA     (GpioPortA<<16u|GpioPin2 <<8u|GpioAf2)
#define PA03_TIM0_GATE    (GpioPortA<<16u|GpioPin3 <<8u|GpioAf2)
#define PA04_UART1_TXD    (GpioPortA<<16u|GpioPin4 <<8u|GpioAf2)
#define PA05_TIM0_ETR     (GpioPortA<<16u|GpioPin5 <<8u|GpioAf2)
#define PA06_PCA_CH0      (GpioPortA<<16u|GpioPin6 <<8u|GpioAf2)
#define PA07_PCA_CH1      (GpioPortA<<16u|GpioPin7 <<8u|GpioAf2)
#define PA08_TIM3_CH0A    (GpioPortA<<16u|GpioPin8 <<8u|GpioAf2)
#define PA09_TIM3_CH1A    (GpioPortA<<16u|GpioPin9 <<8u|GpioAf2)
#define PA10_TIM3_CH2A    (GpioPortA<<16u|GpioPin10<<8u|GpioAf2)
#define PA11_TIM3_GATE    (GpioPortA<<16u|GpioPin11<<8u|GpioAf2)
#define PA12_TIM3_ETR     (GpioPortA<<16u|GpioPin12<<8u|GpioAf2)
#define PA13_UART0_RXD    (GpioPortA<<16u|GpioPin13<<8u|GpioAf2)
#define PA14_UART0_TXD    (GpioPortA<<16u|GpioPin14<<8u|GpioAf2)
#define PA15_UART1_RXD    (GpioPortA<<16u|GpioPin15<<8u|GpioAf2)
#define PB00_TIM3_CH1B    (GpioPortB<<16u|GpioPin0 <<8u|GpioAf2)
#define PB01_PCLK_OUT     (GpioPortB<<16u|GpioPin1 <<8u|GpioAf2)
#define PB02_PCA_ECI      (GpioPortB<<16u|GpioPin2 <<8u|GpioAf2)
#define PB03_TIM0_CHB     (GpioPortB<<16u|GpioPin3 <<8u|GpioAf2)
#define PB04_PCA_CH0      (GpioPortB<<16u|GpioPin4 <<8u|GpioAf2)
#define PB05_2x           (GpioPortB<<16u|GpioPin5 <<8u|GpioAf2)
#define PB06_UART0_TXD    (GpioPortB<<16u|GpioPin6 <<8u|GpioAf2)
#define PB07_UART0_RXD    (GpioPortB<<16u|GpioPin7 <<8u|GpioAf2)
#define PB08_TIM1_CHA     (GpioPortB<<16u|GpioPin8 <<8u|GpioAf2)
#define PB09_IR_OUT       (GpioPortB<<16u|GpioPin9 <<8u|GpioAf2)
#define PB10_SPI1_SCK     (GpioPortB<<16u|GpioPin10<<8u|GpioAf2)
#define PB11_TIM1_CHB     (GpioPortB<<16u|GpioPin11<<8u|GpioAf2)
#define PB12_TIM3_BK      (GpioPortB<<16u|GpioPin12<<8u|GpioAf2)
#define PB13_I2C1_SCL     (GpioPortB<<16u|GpioPin13<<8u|GpioAf2)
#define PB14_I2C1_SDA     (GpioPortB<<16u|GpioPin14<<8u|GpioAf2)
#define PB15_TIM3_CH2B    (GpioPortB<<16u|GpioPin15<<8u|GpioAf2)
#define PC00_PCNT_S0      (GpioPortC<<16u|GpioPin0 <<8u|GpioAf2)
#define PC01_TIM5_CHB     (GpioPortC<<16u|GpioPin1 <<8u|GpioAf2)
#define PC02_LPTIM_TOGN   (GpioPortC<<16u|GpioPin2 <<8u|GpioAf2)
#define PC03_LPTIM_ETR    (GpioPortC<<16u|GpioPin3 <<8u|GpioAf2)
#define PC04_TIM2_ETR     (GpioPortC<<16u|GpioPin4 <<8u|GpioAf2)
#define PC05_TIM6_CHB     (GpioPortC<<16u|GpioPin5 <<8u|GpioAf2)
#define PC06_TIM4_CHA     (GpioPortC<<16u|GpioPin6 <<8u|GpioAf2)
#define PC07_TIM5_CHA     (GpioPortC<<16u|GpioPin7 <<8u|GpioAf2)
#define PC08_TIM6_CHA     (GpioPortC<<16u|GpioPin8 <<8u|GpioAf2)
#define PC09_TIM4_CHB     (GpioPortC<<16u|GpioPin9 <<8u|GpioAf2)
#define PC10_LPUART0_TXD  (GpioPortC<<16u|GpioPin10<<8u|GpioAf2)
#define PC11_LPUART0_RXD  (GpioPortC<<16u|GpioPin11<<8u|GpioAf2)
#define PC12_LPUART1_TXD  (GpioPortC<<16u|GpioPin12<<8u|GpioAf2)
#define PC13_RTC_1HZ      (GpioPortC<<16u|GpioPin13<<8u|GpioAf2)
#define PC14_2x           (GpioPortC<<16u|GpioPin14<<8u|GpioAf2)
#define PC15_2x           (GpioPortC<<16u|GpioPin15<<8u|GpioAf2)
#define PD00_SPI1_CS      (GpioPortD<<16u|GpioPin0 <<8u|GpioAf2)
#define PD01_SPI1_SCK     (GpioPortD<<16u|GpioPin1 <<8u|GpioAf2)
#define PD02_LPUART0_RTS  (GpioPortD<<16u|GpioPin2 <<8u|GpioAf2)
#define PD03_SPI1_MISO    (GpioPortD<<16u|GpioPin3 <<8u|GpioAf2)
#define PD04_SPI1_MOSI    (GpioPortD<<16u|GpioPin4 <<8u|GpioAf2)
#define PD05_LPTIM1_GATE  (GpioPortD<<16u|GpioPin5 <<8u|GpioAf2)
#define PD06_LPTIM1_ETR   (GpioPortD<<16u|GpioPin6 <<8u|GpioAf2)
#define PD07_2x           (GpioPortD<<16u|GpioPin7 <<8u|GpioAf2)
#define PD08_2x           (GpioPortD<<16u|GpioPin8 <<8u|GpioAf2)
#define PD09_2x           (GpioPortD<<16u|GpioPin9 <<8u|GpioAf2)
#define PD10_2x           (GpioPortD<<16u|GpioPin10<<8u|GpioAf2)
#define PD11_2x           (GpioPortD<<16u|GpioPin11<<8u|GpioAf2)
#define PD12_UART2_RTS    (GpioPortD<<16u|GpioPin12<<8u|GpioAf2)
#define PD13_2x           (GpioPortD<<16u|GpioPin13<<8u|GpioAf2)
#define PD14_2x           (GpioPortD<<16u|GpioPin14<<8u|GpioAf2)
#define PD15_UART2_CTS    (GpioPortD<<16u|GpioPin15<<8u|GpioAf2)
#define PE00_2x           (GpioPortE<<16u|GpioPin0 <<8u|GpioAf2)
#define PE01_2x           (GpioPortE<<16u|GpioPin1 <<8u|GpioAf2)
#define PE02_2x           (GpioPortE<<16u|GpioPin2 <<8u|GpioAf2)
#define PE03_2x           (GpioPortE<<16u|GpioPin3 <<8u|GpioAf2)
#define PE04_2x           (GpioPortE<<16u|GpioPin4 <<8u|GpioAf2)
#define PE05_2x           (GpioPortE<<16u|GpioPin5 <<8u|GpioAf2)
#define PE06_2x           (GpioPortE<<16u|GpioPin6 <<8u|GpioAf2)
#define PE07_LPTIM1_GATE  (GpioPortE<<16u|GpioPin7 <<8u|GpioAf2)
#define PE08_LPTIM1_ETR   (GpioPortE<<16u|GpioPin8 <<8u|GpioAf2)
#define PE09_LPTIM1_TOG   (GpioPortE<<16u|GpioPin9 <<8u|GpioAf2)
#define PE10_LPTIM1_TOGN  (GpioPortE<<16u|GpioPin10<<8u|GpioAf2)
#define PE11_2x           (GpioPortE<<16u|GpioPin11<<8u|GpioAf2)
#define PE12_SPI0_CS      (GpioPortE<<16u|GpioPin12<<8u|GpioAf2)
#define PE13_SPI0_SCK     (GpioPortE<<16u|GpioPin13<<8u|GpioAf2)
#define PE14_SPI0_MISO    (GpioPortE<<16u|GpioPin14<<8u|GpioAf2)
#define PE15_SPI0_MOSI    (GpioPortE<<16u|GpioPin15<<8u|GpioAf2)
#define PF00_2x           (GpioPortF<<16u|GpioPin0 <<8u|GpioAf2)
#define PF01_TIM4_CHB     (GpioPortF<<16u|GpioPin1 <<8u|GpioAf2)
#define PF02_2x           (GpioPortF<<16u|GpioPin2 <<8u|GpioAf2)
#define PF03_2x           (GpioPortF<<16u|GpioPin3 <<8u|GpioAf2)
#define PF04_2x           (GpioPortF<<16u|GpioPin4 <<8u|GpioAf2)
#define PF05_2x           (GpioPortF<<16u|GpioPin5 <<8u|GpioAf2)
#define PF06_LPUART1_CTS  (GpioPortF<<16u|GpioPin6 <<8u|GpioAf2)
#define PF07_LPUART1_RTS  (GpioPortF<<16u|GpioPin7 <<8u|GpioAf2)
#define PF09_2x           (GpioPortF<<16u|GpioPin9 <<8u|GpioAf2)
#define PF10_2x           (GpioPortF<<16u|GpioPin10<<8u|GpioAf2)
#define PF11_2x           (GpioPortF<<16u|GpioPin11<<8u|GpioAf2)

///< GpioAf3
#define PA00_TIM0_ETR     (GpioPortA<<16u|GpioPin0 <<8u|GpioAf3)
#define PA01_TIM0_CHB     (GpioPortA<<16u|GpioPin1 <<8u|GpioAf3)
#define PA02_VC1_OUT      (GpioPortA<<16u|GpioPin2 <<8u|GpioAf3)
#define PA03_TIM1_CHB     (GpioPortA<<16u|GpioPin3 <<8u|GpioAf3)
#define PA04_PCA_CH4      (GpioPortA<<16u|GpioPin4 <<8u|GpioAf3)
#define PA05_PCA_ECI      (GpioPortA<<16u|GpioPin5 <<8u|GpioAf3)
#define PA06_TIM3_BK      (GpioPortA<<16u|GpioPin6 <<8u|GpioAf3)
#define PA07_HCLK_OUT     (GpioPortA<<16u|GpioPin7 <<8u|GpioAf3)
#define PA08_3x           (GpioPortA<<16u|GpioPin8 <<8u|GpioAf3)
#define PA09_TIM0_BK      (GpioPortA<<16u|GpioPin9 <<8u|GpioAf3)
#define PA10_TIM2_BK      (GpioPortA<<16u|GpioPin10<<8u|GpioAf3)
#define PA11_I2C1_SCL     (GpioPortA<<16u|GpioPin11<<8u|GpioAf3)
#define PA12_I2C1_SDA     (GpioPortA<<16u|GpioPin12<<8u|GpioAf3)
#define PA13_LVD_OUT      (GpioPortA<<16u|GpioPin13<<8u|GpioAf3)
#define PA14_TIM3_CH2A    (GpioPortA<<16u|GpioPin14<<8u|GpioAf3)
#define PA15_LPUART1_RTS  (GpioPortA<<16u|GpioPin15<<8u|GpioAf3)
#define PB00_LPUART0_TXD  (GpioPortB<<16u|GpioPin0 <<8u|GpioAf3)
#define PB01_TIM3_CH2B    (GpioPortB<<16u|GpioPin1 <<8u|GpioAf3)
#define PB02_LPUART1_TXD  (GpioPortB<<16u|GpioPin2 <<8u|GpioAf3)
#define PB03_TIM1_GATE    (GpioPortB<<16u|GpioPin3 <<8u|GpioAf3)
#define PB04_TIM2_BK      (GpioPortB<<16u|GpioPin4 <<8u|GpioAf3)
#define PB05_TIM1_BK      (GpioPortB<<16u|GpioPin5 <<8u|GpioAf3)
#define PB06_TIM1_CHB     (GpioPortB<<16u|GpioPin6 <<8u|GpioAf3)
#define PB07_TIM2_CHB     (GpioPortB<<16u|GpioPin7 <<8u|GpioAf3)
#define PB08_3x           (GpioPortB<<16u|GpioPin8 <<8u|GpioAf3)
#define PB09_SPI1_CS      (GpioPortB<<16u|GpioPin9 <<8u|GpioAf3)
#define PB10_TIM1_CHA     (GpioPortB<<16u|GpioPin10<<8u|GpioAf3)
#define PB11_LPUART0_RXD  (GpioPortB<<16u|GpioPin11<<8u|GpioAf3)
#define PB12_LPUART0_TXD  (GpioPortB<<16u|GpioPin12<<8u|GpioAf3)
#define PB13_TIM3_CH0B    (GpioPortB<<16u|GpioPin13<<8u|GpioAf3)
#define PB14_TIM3_CH1B    (GpioPortB<<16u|GpioPin14<<8u|GpioAf3)
#define PB15_TIM0_CHB     (GpioPortB<<16u|GpioPin15<<8u|GpioAf3)
#define PC00_UART1_CTS    (GpioPortC<<16u|GpioPin0 <<8u|GpioAf3)
#define PC01_UART1_RTS    (GpioPortC<<16u|GpioPin1 <<8u|GpioAf3)
#define PC02_PCNT_S1      (GpioPortC<<16u|GpioPin2 <<8u|GpioAf3)
#define PC03_LPTIM_TOGN   (GpioPortC<<16u|GpioPin3 <<8u|GpioAf3)
#define PC04_IR_OUT       (GpioPortC<<16u|GpioPin4 <<8u|GpioAf3)
#define PC05_PCA_CH4      (GpioPortC<<16u|GpioPin5 <<8u|GpioAf3)
#define PC06_TIM2_CHA     (GpioPortC<<16u|GpioPin6 <<8u|GpioAf3)
#define PC07_TIM2_CHB     (GpioPortC<<16u|GpioPin7 <<8u|GpioAf3)
#define PC08_TIM2_ETR     (GpioPortC<<16u|GpioPin8 <<8u|GpioAf3)
#define PC09_TIM1_ETR     (GpioPortC<<16u|GpioPin9 <<8u|GpioAf3)
#define PC10_PCA_CH2      (GpioPortC<<16u|GpioPin10<<8u|GpioAf3)
#define PC11_PCA_CH3      (GpioPortC<<16u|GpioPin11<<8u|GpioAf3)
#define PC12_PCA_CH4      (GpioPortC<<16u|GpioPin12<<8u|GpioAf3)
#define PC13_TIM3_CH1B    (GpioPortC<<16u|GpioPin13<<8u|GpioAf3)
#define PC14_3x           (GpioPortC<<16u|GpioPin14<<8u|GpioAf3)
#define PC15_3x           (GpioPortC<<16u|GpioPin15<<8u|GpioAf3)
#define PD00_3x           (GpioPortD<<16u|GpioPin0 <<8u|GpioAf3)
#define PD01_3x           (GpioPortD<<16u|GpioPin1 <<8u|GpioAf3)
#define PD02_TIM1_ETR     (GpioPortD<<16u|GpioPin2 <<8u|GpioAf3)
#define PD03_LPTIM1_TOG   (GpioPortD<<16u|GpioPin3 <<8u|GpioAf3)
#define PD04_LPTIM1_TOGN  (GpioPortD<<16u|GpioPin4 <<8u|GpioAf3)
#define PD05_3x           (GpioPortD<<16u|GpioPin5 <<8u|GpioAf3)
#define PD06_3x           (GpioPortD<<16u|GpioPin6 <<8u|GpioAf3)
#define PD07_3x           (GpioPortD<<16u|GpioPin7 <<8u|GpioAf3)
#define PD08_3x           (GpioPortD<<16u|GpioPin8 <<8u|GpioAf3)
#define PD09_3x           (GpioPortD<<16u|GpioPin9 <<8u|GpioAf3)
#define PD10_3x           (GpioPortD<<16u|GpioPin10<<8u|GpioAf3)
#define PD11_3x           (GpioPortD<<16u|GpioPin11<<8u|GpioAf3)
#define PD12_3x           (GpioPortD<<16u|GpioPin12<<8u|GpioAf3)
#define PD13_3x           (GpioPortD<<16u|GpioPin13<<8u|GpioAf3)
#define PD14_3x           (GpioPortD<<16u|GpioPin14<<8u|GpioAf3)
#define PD15_3x           (GpioPortD<<16u|GpioPin15<<8u|GpioAf3)
#define PE00_3x           (GpioPortE<<16u|GpioPin0 <<8u|GpioAf3)
#define PE01_3x           (GpioPortE<<16u|GpioPin1 <<8u|GpioAf3)
#define PE02_3x           (GpioPortE<<16u|GpioPin2 <<8u|GpioAf3)
#define PE03_3x           (GpioPortE<<16u|GpioPin3 <<8u|GpioAf3)
#define PE04_3x           (GpioPortE<<16u|GpioPin4 <<8u|GpioAf3)
#define PE05_3x           (GpioPortE<<16u|GpioPin5 <<8u|GpioAf3)
#define PE06_3x           (GpioPortE<<16u|GpioPin6 <<8u|GpioAf3)
#define PE07_3x           (GpioPortE<<16u|GpioPin7 <<8u|GpioAf3)
#define PE08_3x           (GpioPortE<<16u|GpioPin8 <<8u|GpioAf3)
#define PE09_3x           (GpioPortE<<16u|GpioPin9 <<8u|GpioAf3)
#define PE10_3x           (GpioPortE<<16u|GpioPin10<<8u|GpioAf3)
#define PE11_3x           (GpioPortE<<16u|GpioPin11<<8u|GpioAf3)
#define PE12_UART3_CTS    (GpioPortE<<16u|GpioPin12<<8u|GpioAf3)
#define PE13_UART3_RTS    (GpioPortE<<16u|GpioPin13<<8u|GpioAf3)
#define PE14_UART3_RXD    (GpioPortE<<16u|GpioPin14<<8u|GpioAf3)
#define PE15_UART3_TXD    (GpioPortE<<16u|GpioPin15<<8u|GpioAf3)
#define PF00_UART1_TXD    (GpioPortF<<16u|GpioPin0 <<8u|GpioAf3)
#define PF01_UART1_RXD    (GpioPortF<<16u|GpioPin1 <<8u|GpioAf3)
#define PF02_3x           (GpioPortF<<16u|GpioPin2 <<8u|GpioAf3)
#define PF03_3x           (GpioPortF<<16u|GpioPin3 <<8u|GpioAf3)
#define PF04_3x           (GpioPortF<<16u|GpioPin4 <<8u|GpioAf3)
#define PF05_3x           (GpioPortF<<16u|GpioPin5 <<8u|GpioAf3)
#define PF06_UART0_CTS    (GpioPortF<<16u|GpioPin6 <<8u|GpioAf3)
#define PF07_UART0_RTS    (GpioPortF<<16u|GpioPin7 <<8u|GpioAf3)
#define PF09_3x           (GpioPortF<<16u|GpioPin9 <<8u|GpioAf3)
#define PF10_3x           (GpioPortF<<16u|GpioPin10<<8u|GpioAf3)
#define PF11_3x           (GpioPortF<<16u|GpioPin11<<8u|GpioAf3)

