RT-Thread/rt-thread/bsp/hc32l196/libraries/HC32L196_StdPeriph_Driver/inc/hc32l196_gpio.h
///< GpioAf4
#define PA00_VC0_OUT      (GpioPortA<<16u|GpioPin0 <<8u|GpioAf4)
#define PA01_TIM1_ETR     (GpioPortA<<16u|GpioPin1 <<8u|GpioAf4)
#define PA02_TIM1_CHA     (GpioPortA<<16u|GpioPin2 <<8u|GpioAf4)
#define PA03_TIM2_CHB     (GpioPortA<<16u|GpioPin3 <<8u|GpioAf4)
#define PA04_TIM2_ETR     (GpioPortA<<16u|GpioPin4 <<8u|GpioAf4)
#define PA05_TIM0_CHA     (GpioPortA<<16u|GpioPin5 <<8u|GpioAf4)
#define PA06_TIM1_CHA     (GpioPortA<<16u|GpioPin6 <<8u|GpioAf4)
#define PA07_TIM3_CH0B    (GpioPortA<<16u|GpioPin7 <<8u|GpioAf4)
#define PA08_4x           (GpioPortA<<16u|GpioPin8 <<8u|GpioAf4)
#define PA09_I2C0_SCL     (GpioPortA<<16u|GpioPin9 <<8u|GpioAf4)
#define PA10_I2C0_SDA     (GpioPortA<<16u|GpioPin10<<8u|GpioAf4)
#define PA11_4x           (GpioPortA<<16u|GpioPin11<<8u|GpioAf4)
#define PA12_4x           (GpioPortA<<16u|GpioPin12<<8u|GpioAf4)
#define PA13_TIM3_ETR     (GpioPortA<<16u|GpioPin13<<8u|GpioAf4)
#define PA14_LVD_OUT      (GpioPortA<<16u|GpioPin14<<8u|GpioAf4)
#define PA15_TIM0_ETR     (GpioPortA<<16u|GpioPin15<<8u|GpioAf4)
#define PB00_TIM5_CHB     (GpioPortB<<16u|GpioPin0 <<8u|GpioAf4)
#define PB01_TIM6_CHB     (GpioPortB<<16u|GpioPin1 <<8u|GpioAf4)
#define PB02_TIM4_CHA     (GpioPortB<<16u|GpioPin2 <<8u|GpioAf4)
#define PB03_TIM3_CH0A    (GpioPortB<<16u|GpioPin3 <<8u|GpioAf4)
#define PB04_UART0_CTS    (GpioPortB<<16u|GpioPin4 <<8u|GpioAf4)
#define PB05_PCA_CH1      (GpioPortB<<16u|GpioPin5 <<8u|GpioAf4)
#define PB06_TIM0_CHA     (GpioPortB<<16u|GpioPin6 <<8u|GpioAf4)
#define PB07_LPUART1_CTS  (GpioPortB<<16u|GpioPin7 <<8u|GpioAf4)
#define PB08_TIM2_CHA     (GpioPortB<<16u|GpioPin8 <<8u|GpioAf4)
#define PB09_TIM2_CHA     (GpioPortB<<16u|GpioPin9 <<8u|GpioAf4)
#define PB10_LPUART0_TXD  (GpioPortB<<16u|GpioPin10<<8u|GpioAf4)
#define PB11_TIM2_GATE    (GpioPortB<<16u|GpioPin11<<8u|GpioAf4)
#define PB12_TIM0_BK      (GpioPortB<<16u|GpioPin12<<8u|GpioAf4)
#define PB13_LPUART0_CTS  (GpioPortB<<16u|GpioPin13<<8u|GpioAf4)
#define PB14_TIM0_CHA     (GpioPortB<<16u|GpioPin14<<8u|GpioAf4)
#define PB15_TIM0_GATE    (GpioPortB<<16u|GpioPin15<<8u|GpioAf4)
#define PC00_UART2_RTS    (GpioPortC<<16u|GpioPin0 <<8u|GpioAf4)
#define PC01_PCNT_S0FO    (GpioPortC<<16u|GpioPin1 <<8u|GpioAf4)
#define PC02_UART2_RXD    (GpioPortC<<16u|GpioPin2 <<8u|GpioAf4)
#define PC03_PCNT_S1FO    (GpioPortC<<16u|GpioPin3 <<8u|GpioAf4)
#define PC04_VC2_OUT      (GpioPortC<<16u|GpioPin4 <<8u|GpioAf4)
#define PC05_4x           (GpioPortC<<16u|GpioPin5 <<8u|GpioAf4)
#define PC06_LPTIM1_GATE  (GpioPortC<<16u|GpioPin6 <<8u|GpioAf4)
#define PC07_LPTIM1_ETR   (GpioPortC<<16u|GpioPin7 <<8u|GpioAf4)
#define PC08_LPTIM1_TOG   (GpioPortC<<16u|GpioPin8 <<8u|GpioAf4)
#define PC09_LPTIM1_TOGN  (GpioPortC<<16u|GpioPin9 <<8u|GpioAf4)
#define PC10_4x           (GpioPortC<<16u|GpioPin10<<8u|GpioAf4)
#define PC11_PCNT_S0FO    (GpioPortC<<16u|GpioPin11<<8u|GpioAf4)
#define PC12_PCNT_S1FO    (GpioPortC<<16u|GpioPin12<<8u|GpioAf4)
#define PC13_4x           (GpioPortC<<16u|GpioPin13<<8u|GpioAf4)
#define PC14_4x           (GpioPortC<<16u|GpioPin14<<8u|GpioAf4)
#define PC15_4x           (GpioPortC<<16u|GpioPin15<<8u|GpioAf4)
#define PD00_4x           (GpioPortD<<16u|GpioPin0 <<8u|GpioAf4)
#define PD01_4x           (GpioPortD<<16u|GpioPin1 <<8u|GpioAf4)
#define PD02_4x           (GpioPortD<<16u|GpioPin2 <<8u|GpioAf4)
#define PD03_4x           (GpioPortD<<16u|GpioPin3 <<8u|GpioAf4)
#define PD04_4x           (GpioPortD<<16u|GpioPin4 <<8u|GpioAf4)
#define PD05_4x           (GpioPortD<<16u|GpioPin5 <<8u|GpioAf4)
#define PD06_4x           (GpioPortD<<16u|GpioPin6 <<8u|GpioAf4)
#define PD07_4x           (GpioPortD<<16u|GpioPin7 <<8u|GpioAf4)
#define PD08_4x           (GpioPortD<<16u|GpioPin8 <<8u|GpioAf4)
#define PD09_4x           (GpioPortD<<16u|GpioPin9 <<8u|GpioAf4)
#define PD10_4x           (GpioPortD<<16u|GpioPin10<<8u|GpioAf4)
#define PD11_4x           (GpioPortD<<16u|GpioPin11<<8u|GpioAf4)
#define PD12_4x           (GpioPortD<<16u|GpioPin12<<8u|GpioAf4)
#define PD13_4x           (GpioPortD<<16u|GpioPin13<<8u|GpioAf4)
#define PD14_4x           (GpioPortD<<16u|GpioPin14<<8u|GpioAf4)
#define PD15_4x           (GpioPortD<<16u|GpioPin15<<8u|GpioAf4)
#define PE00_4x           (GpioPortE<<16u|GpioPin0 <<8u|GpioAf4)
#define PE01_4x           (GpioPortE<<16u|GpioPin1 <<8u|GpioAf4)
#define PE02_4x           (GpioPortE<<16u|GpioPin2 <<8u|GpioAf4)
#define PE03_4x           (GpioPortE<<16u|GpioPin3 <<8u|GpioAf4)
#define PE04_4x           (GpioPortE<<16u|GpioPin4 <<8u|GpioAf4)
#define PE05_4x           (GpioPortE<<16u|GpioPin5 <<8u|GpioAf4)
#define PE06_4x           (GpioPortE<<16u|GpioPin6 <<8u|GpioAf4)
#define PE07_4x           (GpioPortE<<16u|GpioPin7 <<8u|GpioAf4)
#define PE08_4x           (GpioPortE<<16u|GpioPin8 <<8u|GpioAf4)
#define PE09_4x           (GpioPortE<<16u|GpioPin9 <<8u|GpioAf4)
#define PE10_4x           (GpioPortE<<16u|GpioPin10<<8u|GpioAf4)
#define PE11_4x           (GpioPortE<<16u|GpioPin11<<8u|GpioAf4)
#define PE12_4x           (GpioPortE<<16u|GpioPin12<<8u|GpioAf4)
#define PE13_4x           (GpioPortE<<16u|GpioPin13<<8u|GpioAf4)
#define PE14_4x           (GpioPortE<<16u|GpioPin14<<8u|GpioAf4)
#define PE15_4x           (GpioPortE<<16u|GpioPin15<<8u|GpioAf4)
#define PF00_4x           (GpioPortF<<16u|GpioPin0 <<8u|GpioAf4)
#define PF01_4x           (GpioPortF<<16u|GpioPin1 <<8u|GpioAf4)
#define PF02_4x           (GpioPortF<<16u|GpioPin2 <<8u|GpioAf4)
#define PF03_4x           (GpioPortF<<16u|GpioPin3 <<8u|GpioAf4)
#define PF04_4x           (GpioPortF<<16u|GpioPin4 <<8u|GpioAf4)
#define PF05_4x           (GpioPortF<<16u|GpioPin5 <<8u|GpioAf4)
#define PF06_4x           (GpioPortF<<16u|GpioPin6 <<8u|GpioAf4)
#define PF07_4x           (GpioPortF<<16u|GpioPin7 <<8u|GpioAf4)
#define PF09_4x           (GpioPortF<<16u|GpioPin9 <<8u|GpioAf4)
#define PF10_4x           (GpioPortF<<16u|GpioPin10<<8u|GpioAf4)
#define PF11_4x           (GpioPortF<<16u|GpioPin11<<8u|GpioAf4)

///< GpioAf5
#define PA00_TIM1_CHA     (GpioPortA<<16u|GpioPin0 <<8u|GpioAf5)
#define PA01_TIM1_CHB     (GpioPortA<<16u|GpioPin1 <<8u|GpioAf5)
#define PA02_TIM2_CHA     (GpioPortA<<16u|GpioPin2 <<8u|GpioAf5)
#define PA03_SPI1_CS      (GpioPortA<<16u|GpioPin3 <<8u|GpioAf5)
#define PA04_TIM5_CHA     (GpioPortA<<16u|GpioPin4 <<8u|GpioAf5)
#define PA05_TIM5_CHB     (GpioPortA<<16u|GpioPin5 <<8u|GpioAf5)
#define PA06_VC0_OUT      (GpioPortA<<16u|GpioPin6 <<8u|GpioAf5)
#define PA07_TIM2_CHA     (GpioPortA<<16u|GpioPin7 <<8u|GpioAf5)
#define PA08_TIM1_GATE    (GpioPortA<<16u|GpioPin8 <<8u|GpioAf5)
#define PA09_5x           (GpioPortA<<16u|GpioPin9 <<8u|GpioAf5)
#define PA10_TIM2_GATE    (GpioPortA<<16u|GpioPin10<<8u|GpioAf5)
#define PA11_VC0_OUT      (GpioPortA<<16u|GpioPin11<<8u|GpioAf5)
#define PA12_VC1_OUT      (GpioPortA<<16u|GpioPin12<<8u|GpioAf5)
#define PA13_RTC_1HZ      (GpioPortA<<16u|GpioPin13<<8u|GpioAf5)
#define PA14_RCH_OUT      (GpioPortA<<16u|GpioPin14<<8u|GpioAf5)
#define PA15_TIM0_CHA     (GpioPortA<<16u|GpioPin15<<8u|GpioAf5)
#define PB00_RCH_OUT      (GpioPortB<<16u|GpioPin0 <<8u|GpioAf5)
#define PB01_LPUART0_RTS  (GpioPortB<<16u|GpioPin1 <<8u|GpioAf5)
#define PB02_TIM1_BK      (GpioPortB<<16u|GpioPin2 <<8u|GpioAf5)
#define PB03_LPTIM_GATE   (GpioPortB<<16u|GpioPin3 <<8u|GpioAf5)
#define PB04_TIM2_GATE    (GpioPortB<<16u|GpioPin4 <<8u|GpioAf5)
#define PB05_LPTIM_GATE   (GpioPortB<<16u|GpioPin5 <<8u|GpioAf5)
#define PB06_LPTIM_ETR    (GpioPortB<<16u|GpioPin6 <<8u|GpioAf5)
#define PB07_TIM0_CHB     (GpioPortB<<16u|GpioPin7 <<8u|GpioAf5)
#define PB08_TIM0_GATE    (GpioPortB<<16u|GpioPin8 <<8u|GpioAf5)
#define PB09_5x           (GpioPortB<<16u|GpioPin9 <<8u|GpioAf5)
#define PB10_TIM3_CH1A    (GpioPortB<<16u|GpioPin10<<8u|GpioAf5)
#define PB11_TIM6_CHA     (GpioPortB<<16u|GpioPin11<<8u|GpioAf5)
#define PB12_5x           (GpioPortB<<16u|GpioPin12<<8u|GpioAf5)
#define PB13_TIM1_CHA     (GpioPortB<<16u|GpioPin13<<8u|GpioAf5)
#define PB14_RTC_1HZ      (GpioPortB<<16u|GpioPin14<<8u|GpioAf5)
#define PB15_5x           (GpioPortB<<16u|GpioPin15<<8u|GpioAf5)
#define PC00_5x           (GpioPortC<<16u|GpioPin0 <<8u|GpioAf5)
#define PC01_5x           (GpioPortC<<16u|GpioPin1 <<8u|GpioAf5)
#define PC02_5x           (GpioPortC<<16u|GpioPin2 <<8u|GpioAf5)
#define PC03_UART2_TXD    (GpioPortC<<16u|GpioPin3 <<8u|GpioAf5)
#define PC04_5x           (GpioPortC<<16u|GpioPin4 <<8u|GpioAf5)
#define PC05_5x           (GpioPortC<<16u|GpioPin5 <<8u|GpioAf5)
#define PC06_5x           (GpioPortC<<16u|GpioPin6 <<8u|GpioAf5)
#define PC07_5x           (GpioPortC<<16u|GpioPin7 <<8u|GpioAf5)
#define PC08_5x           (GpioPortC<<16u|GpioPin8 <<8u|GpioAf5)
#define PC09_5x           (GpioPortC<<16u|GpioPin9 <<8u|GpioAf5)
#define PC10_5x           (GpioPortC<<16u|GpioPin10<<8u|GpioAf5)
#define PC11_5x           (GpioPortC<<16u|GpioPin11<<8u|GpioAf5)
#define PC12_5x           (GpioPortC<<16u|GpioPin12<<8u|GpioAf5)
#define PC13_5x           (GpioPortC<<16u|GpioPin13<<8u|GpioAf5)
#define PC14_5x           (GpioPortC<<16u|GpioPin14<<8u|GpioAf5)
#define PC15_5x           (GpioPortC<<16u|GpioPin15<<8u|GpioAf5)
#define PD00_5x           (GpioPortD<<16u|GpioPin0 <<8u|GpioAf5)
#define PD01_5x           (GpioPortD<<16u|GpioPin1 <<8u|GpioAf5)
#define PD02_5x           (GpioPortD<<16u|GpioPin2 <<8u|GpioAf5)
#define PD03_5x           (GpioPortD<<16u|GpioPin3 <<8u|GpioAf5)
#define PD04_5x           (GpioPortD<<16u|GpioPin4 <<8u|GpioAf5)
#define PD05_5x           (GpioPortD<<16u|GpioPin5 <<8u|GpioAf5)
#define PD06_5x           (GpioPortD<<16u|GpioPin6 <<8u|GpioAf5)
#define PD07_5x           (GpioPortD<<16u|GpioPin7 <<8u|GpioAf5)
#define PD08_5x           (GpioPortD<<16u|GpioPin8 <<8u|GpioAf5)
#define PD09_5x           (GpioPortD<<16u|GpioPin9 <<8u|GpioAf5)
#define PD10_5x           (GpioPortD<<16u|GpioPin10<<8u|GpioAf5)
#define PD11_5x           (GpioPortD<<16u|GpioPin11<<8u|GpioAf5)
#define PD12_5x           (GpioPortD<<16u|GpioPin12<<8u|GpioAf5)
#define PD13_5x           (GpioPortD<<16u|GpioPin13<<8u|GpioAf5)
#define PD14_5x           (GpioPortD<<16u|GpioPin14<<8u|GpioAf5)
#define PD15_5x           (GpioPortD<<16u|GpioPin15<<8u|GpioAf5)
#define PE00_5x           (GpioPortE<<16u|GpioPin0 <<8u|GpioAf5)
#define PE01_5x           (GpioPortE<<16u|GpioPin1 <<8u|GpioAf5)
#define PE02_5x           (GpioPortE<<16u|GpioPin2 <<8u|GpioAf5)
#define PE03_5x           (GpioPortE<<16u|GpioPin3 <<8u|GpioAf5)
#define PE04_5x           (GpioPortE<<16u|GpioPin4 <<8u|GpioAf5)
#define PE05_5x           (GpioPortE<<16u|GpioPin5 <<8u|GpioAf5)
#define PE06_5x           (GpioPortE<<16u|GpioPin6 <<8u|GpioAf5)
#define PE07_5x           (GpioPortE<<16u|GpioPin7 <<8u|GpioAf5)
#define PE08_5x           (GpioPortE<<16u|GpioPin8 <<8u|GpioAf5)
#define PE09_5x           (GpioPortE<<16u|GpioPin9 <<8u|GpioAf5)
#define PE10_5x           (GpioPortE<<16u|GpioPin10<<8u|GpioAf5)
#define PE11_5x           (GpioPortE<<16u|GpioPin11<<8u|GpioAf5)
#define PE12_5x           (GpioPortE<<16u|GpioPin12<<8u|GpioAf5)
#define PE13_5x           (GpioPortE<<16u|GpioPin13<<8u|GpioAf5)
#define PE14_5x           (GpioPortE<<16u|GpioPin14<<8u|GpioAf5)
#define PE15_5x           (GpioPortE<<16u|GpioPin15<<8u|GpioAf5)
#define PF00_5x           (GpioPortF<<16u|GpioPin0 <<8u|GpioAf5)
#define PF01_5x           (GpioPortF<<16u|GpioPin1 <<8u|GpioAf5)
#define PF02_5x           (GpioPortF<<16u|GpioPin2 <<8u|GpioAf5)
#define PF03_5x           (GpioPortF<<16u|GpioPin3 <<8u|GpioAf5)
#define PF04_5x           (GpioPortF<<16u|GpioPin4 <<8u|GpioAf5)
#define PF05_5x           (GpioPortF<<16u|GpioPin5 <<8u|GpioAf5)
#define PF06_5x           (GpioPortF<<16u|GpioPin6 <<8u|GpioAf5)
#define PF07_5x           (GpioPortF<<16u|GpioPin7 <<8u|GpioAf5)
#define PF09_5x           (GpioPortF<<16u|GpioPin9 <<8u|GpioAf5)
#define PF10_5x           (GpioPortF<<16u|GpioPin10<<8u|GpioAf5)
#define PF11_5x           (GpioPortF<<16u|GpioPin11<<8u|GpioAf5)

///< GpioAf6
#define PA00_TIM3_ETR     (GpioPortA<<16u|GpioPin0 <<8u|GpioAf6)
#define PA01_HCLK_OUT     (GpioPortA<<16u|GpioPin1 <<8u|GpioAf6)
#define PA02_PCLK_OUT     (GpioPortA<<16u|GpioPin2 <<8u|GpioAf6)
#define PA03_TIM3_CH1A    (GpioPortA<<16u|GpioPin3 <<8u|GpioAf6)
#define PA04_LVD_OUT      (GpioPortA<<16u|GpioPin4 <<8u|GpioAf6)
#define PA05_XTL_OUT      (GpioPortA<<16u|GpioPin5 <<8u|GpioAf6)
#define PA06_TIM3_GATE    (GpioPortA<<16u|GpioPin6 <<8u|GpioAf6)
#define PA07_VC1_OUT      (GpioPortA<<16u|GpioPin7 <<8u|GpioAf6)
#define PA08_TIM4_CHA     (GpioPortA<<16u|GpioPin8 <<8u|GpioAf6)
#define PA09_HCLK_OUT     (GpioPortA<<16u|GpioPin9 <<8u|GpioAf6)
#define PA10_PCLK_OUT     (GpioPortA<<16u|GpioPin10<<8u|GpioAf6)
#define PA11_SPI0_MISO    (GpioPortA<<16u|GpioPin11<<8u|GpioAf6)
#define PA12_SPI0_MOSI    (GpioPortA<<16u|GpioPin12<<8u|GpioAf6)
#define PA13_PCNT_S1      (GpioPortA<<16u|GpioPin13<<8u|GpioAf6)
#define PA14_RCL_OUT      (GpioPortA<<16u|GpioPin14<<8u|GpioAf6)
#define PA15_TIM3_CH1A    (GpioPortA<<16u|GpioPin15<<8u|GpioAf6)
#define PB00_RCL_OUT      (GpioPortB<<16u|GpioPin0 <<8u|GpioAf6)
#define PB01_VC2_OUT      (GpioPortB<<16u|GpioPin1 <<8u|GpioAf6)
#define PB02_TIM0_BK      (GpioPortB<<16u|GpioPin2 <<8u|GpioAf6)
#define PB03_XTL_OUT      (GpioPortB<<16u|GpioPin3 <<8u|GpioAf6)
#define PB04_TIM3_CH0B    (GpioPortB<<16u|GpioPin4 <<8u|GpioAf6)
#define PB05_PCNT_S0      (GpioPortB<<16u|GpioPin5 <<8u|GpioAf6)
#define PB06_TIM3_CH0A    (GpioPortB<<16u|GpioPin6 <<8u|GpioAf6)
#define PB07_LPTIM_TOGN   (GpioPortB<<16u|GpioPin7 <<8u|GpioAf6)
#define PB08_TIM3_CH2A    (GpioPortB<<16u|GpioPin8 <<8u|GpioAf6)
#define PB09_TIM2_CHB     (GpioPortB<<16u|GpioPin9 <<8u|GpioAf6)
#define PB10_LPUART1_RTS  (GpioPortB<<16u|GpioPin10<<8u|GpioAf6)
#define PB11_LPUART1_CTS  (GpioPortB<<16u|GpioPin11<<8u|GpioAf6)
#define PB12_LPUART0_RTS  (GpioPortB<<16u|GpioPin12<<8u|GpioAf6)
#define PB13_TIM1_GATE    (GpioPortB<<16u|GpioPin13<<8u|GpioAf6)
#define PB14_LPUART0_RTS  (GpioPortB<<16u|GpioPin14<<8u|GpioAf6)
#define PB15_6x           (GpioPortB<<16u|GpioPin15<<8u|GpioAf6)
#define PC00_6x           (GpioPortC<<16u|GpioPin0 <<8u|GpioAf6)
#define PC01_UART2_CTS    (GpioPortC<<16u|GpioPin1 <<8u|GpioAf6)
#define PC02_6x           (GpioPortC<<16u|GpioPin2 <<8u|GpioAf6)
#define PC03_6x           (GpioPortC<<16u|GpioPin3 <<8u|GpioAf6)
#define PC04_6x           (GpioPortC<<16u|GpioPin4 <<8u|GpioAf6)
#define PC05_6x           (GpioPortC<<16u|GpioPin5 <<8u|GpioAf6)
#define PC06_UART3_RXD    (GpioPortC<<16u|GpioPin6 <<8u|GpioAf6)
#define PC07_UART3_TXD    (GpioPortC<<16u|GpioPin7 <<8u|GpioAf6)
#define PC08_UART3_CTS    (GpioPortC<<16u|GpioPin8 <<8u|GpioAf6)
#define PC09_UART3_RTS    (GpioPortC<<16u|GpioPin9 <<8u|GpioAf6)
#define PC10_6x           (GpioPortC<<16u|GpioPin10<<8u|GpioAf6)
#define PC11_6x           (GpioPortC<<16u|GpioPin11<<8u|GpioAf6)
#define PC12_6x           (GpioPortC<<16u|GpioPin12<<8u|GpioAf6)
#define PC13_6x           (GpioPortC<<16u|GpioPin13<<8u|GpioAf6)
#define PC14_6x           (GpioPortC<<16u|GpioPin14<<8u|GpioAf6)
#define PC15_6x           (GpioPortC<<16u|GpioPin15<<8u|GpioAf6)
#define PD00_6x           (GpioPortD<<16u|GpioPin0 <<8u|GpioAf6)
#define PD01_6x           (GpioPortD<<16u|GpioPin1 <<8u|GpioAf6)
#define PD02_6x           (GpioPortD<<16u|GpioPin2 <<8u|GpioAf6)
#define PD03_6x           (GpioPortD<<16u|GpioPin3 <<8u|GpioAf6)
#define PD04_6x           (GpioPortD<<16u|GpioPin4 <<8u|GpioAf6)
#define PD05_6x           (GpioPortD<<16u|GpioPin5 <<8u|GpioAf6)
#define PD06_6x           (GpioPortD<<16u|GpioPin6 <<8u|GpioAf6)
#define PD07_6x           (GpioPortD<<16u|GpioPin7 <<8u|GpioAf6)
#define PD08_6x           (GpioPortD<<16u|GpioPin8 <<8u|GpioAf6)
#define PD09_6x           (GpioPortD<<16u|GpioPin9 <<8u|GpioAf6)
#define PD10_6x           (GpioPortD<<16u|GpioPin10<<8u|GpioAf6)
#define PD11_6x           (GpioPortD<<16u|GpioPin11<<8u|GpioAf6)
#define PD12_6x           (GpioPortD<<16u|GpioPin12<<8u|GpioAf6)
#define PD13_6x           (GpioPortD<<16u|GpioPin13<<8u|GpioAf6)
#define PD14_6x           (GpioPortD<<16u|GpioPin14<<8u|GpioAf6)
#define PD15_6x           (GpioPortD<<16u|GpioPin15<<8u|GpioAf6)
#define PE00_6x           (GpioPortE<<16u|GpioPin0 <<8u|GpioAf6)
#define PE01_6x           (GpioPortE<<16u|GpioPin1 <<8u|GpioAf6)
#define PE02_6x           (GpioPortE<<16u|GpioPin2 <<8u|GpioAf6)
#define PE03_6x           (GpioPortE<<16u|GpioPin3 <<8u|GpioAf6)
#define PE04_6x           (GpioPortE<<16u|GpioPin4 <<8u|GpioAf6)
#define PE05_6x           (GpioPortE<<16u|GpioPin5 <<8u|GpioAf6)
#define PE06_6x           (GpioPortE<<16u|GpioPin6 <<8u|GpioAf6)
#define PE07_6x           (GpioPortE<<16u|GpioPin7 <<8u|GpioAf6)
#define PE08_6x           (GpioPortE<<16u|GpioPin8 <<8u|GpioAf6)
#define PE09_6x           (GpioPortE<<16u|GpioPin9 <<8u|GpioAf6)
#define PE10_6x           (GpioPortE<<16u|GpioPin10<<8u|GpioAf6)
#define PE11_6x           (GpioPortE<<16u|GpioPin11<<8u|GpioAf6)
#define PE12_6x           (GpioPortE<<16u|GpioPin12<<8u|GpioAf6)
#define PE13_6x           (GpioPortE<<16u|GpioPin13<<8u|GpioAf6)
#define PE14_6x           (GpioPortE<<16u|GpioPin14<<8u|GpioAf6)
#define PE15_6x           (GpioPortE<<16u|GpioPin15<<8u|GpioAf6)
#define PF00_6x           (GpioPortF<<16u|GpioPin0 <<8u|GpioAf6)
#define PF01_6x           (GpioPortF<<16u|GpioPin1 <<8u|GpioAf6)
#define PF02_6x           (GpioPortF<<16u|GpioPin2 <<8u|GpioAf6)
#define PF03_6x           (GpioPortF<<16u|GpioPin3 <<8u|GpioAf6)
#define PF04_6x           (GpioPortF<<16u|GpioPin4 <<8u|GpioAf6)
#define PF05_6x           (GpioPortF<<16u|GpioPin5 <<8u|GpioAf6)
#define PF06_6x           (GpioPortF<<16u|GpioPin6 <<8u|GpioAf6)
#define PF07_6x           (GpioPortF<<16u|GpioPin7 <<8u|GpioAf6)
#define PF09_6x           (GpioPortF<<16u|GpioPin9 <<8u|GpioAf6)
#define PF10_6x           (GpioPortF<<16u|GpioPin10<<8u|GpioAf6)
#define PF11_6x           (GpioPortF<<16u|GpioPin11<<8u|GpioAf6)

